In [1]:
import pandas as pd

### Import the dataset 'Salaries.csv'.

In [4]:
df = pd.read_csv('Salaries.csv')

### Display how many rows and how many columns.

In [6]:
df.shape

(78, 6)

###  Display first 10 rows and last 15 rows.

In [7]:
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [8]:
df.tail(15)

         rank discipline  phd  service     sex  salary
63       Prof          A   29       27  Female   91000
64  AssocProf          A   26       24  Female   73300
65       Prof          A   36       19  Female  117555
66   AsstProf          A    7        6  Female   63100
67       Prof          A   17       11  Female   90450
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

### Which Male and Female Professor has the highest and the lowest salaries?

In [17]:
male = df.loc[df['sex']=='Male']
male['salary'].max()

186960

In [16]:
female = df.loc[df['sex']=='Female']
female['salary'].max()

161101

### Which Professor takes the highest and lowest salaries?

In [31]:
max_salary=df['salary'].max()
max_sal_rank=df.loc[df['salary']==max_salary]
max_sal_rank['rank']

0    Prof
Name: rank, dtype: object

### Missing 'Salaries' - should be replaced as mean of the matching salaries of those whose 'service' is the same

In [34]:
df.isnull().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [33]:
mean_salaries = df.groupby('service')['salary'].mean()

# Replace missing salaries with mean values
mean_salaries

# Now 'salaries' column contains the updated values

service
0      86583.333333
1      72500.000000
2      80506.250000
3      90745.142857
4      92000.000000
5      97032.000000
6      86880.666667
7     110102.000000
8      93532.500000
9      71065.000000
10    104398.000000
11     97031.500000
14    118733.000000
15    135373.500000
17    105703.000000
18    120612.000000
19    128241.333333
20    118866.000000
21    155750.000000
22     62884.000000
23    117603.666667
24     73300.000000
25    140096.000000
26    144651.000000
27    120750.000000
30    103106.000000
31    115311.500000
33    145225.000000
36    137000.000000
43    155865.000000
45    146856.000000
49    186960.000000
51     57800.000000
Name: salary, dtype: float64